{
    "app_name": "Tajweed Recognition",
    "tab_list": [
        { "tab_name": "Mengenali Tadjwid", "tab_path": "/recognition"},
        { "tab_name": "Daftar Tadjwid", "tab_path": "/tajweed-list"}
    ],
    "app_description": "Selamat datang di Tajweed Recognition - Aplikasi inovatif yang menggunakan teknologi OCR untuk membedakan hukum dan aturan tajwid dalam teks Arab pada gambar, dilengkapi dengan penekanan warna pada tajwid dan penjelasan interaktif untuk memudahkan pembelajaran.",
    "tab_icons": ["/images/recognition-icon.svg", "/images/list-icon.svg"],
    "tab_icons_dark": ["/images/recognition-icon-dark.svg", "/images/list-icon-dark.svg"],
    "browser_warning": "Browser Anda tidak mendukung Local Storage/Cookies!\nSilakan aktifkan cookies di browser Anda atau matikan mode incognito.\nTerima kasih.",
    "error_alert": "Kesalahan",
    "error_solution": "Silakan muat ulang halaman.",
    "drop_image_or_pdf": "Seret gambar/pdf ke sini",
    "additional_setting": "Pengaturan Tambahan",
    "additional_setting_desc": "Centang pada kotak di bawah untuk menggunakan fitur OCR pada file pdf jika file pdf berisi teks dalam gambar atau dokumen yang dipindai.",
    "enable_ocr": "Gunakan OCR",
    "ok": "Oke",
    "invalid_file": ["Tipe File Tidak Didukung!", "Silakan pilih file gambar/pdf."],
    "file_size_limit": ["Ukuran File Melebihi Batas!", "Silakan pilih file gambar/pdf kurang dari 5MB."],
    "empty_text": ["Tidak ada teks!", "Silakan coba file lain yang terdapat huruf."],
    "empty_arabic_text": ["Tidak ada teks Arab ditemukan!", "Silakan coba dengan teks yang terdapat huruf Arab."],
    "recognition_failed": "Gagal Mengenali Teks!",
    "sidebar_title": "Pengaturan Tampilan Tadjwid",
    "select_all": "Pilih Semua",
    "unsaved_warning": "Apakah Anda yakin ingin menutup hasil ini?",
    "capture_image": "Ambil Gambar",
    "capture_error": "Tidak dapat mengambil gambar!",
    "device_orientation_alert": "Kamera dapat berfungsi dengan optimal pada poisisi portrait.",
    "camera_permission": "Izinkan Akses Kamera",
    "camera_title_alert": ["Gagal Mengakses Kamera", "Sambungan Tidak Aman", "Akses Kamera Ditolak"],
    "camera_text_alert": ["", "Pastikan browser Anda menggunakan protokol HTTPS", "Pastikan Anda telah Mengizinkan Akses Kamera"],
    "canvas_is_null": "Elemen Canvas null.",
    "select_file`": "Pilih Gambar/PDF",
    "screen_capture": "Tangkapan Layar",
    "manual_input": "Input Manual",
    "recognizing": "Memproses...",
    "container_title": ["Editor", "Hasil"],
    "generate": "Generate",
    "detail_tajweed": "Lihat Detil",
    "search_items": "Cari Tadjwid",
    "filter_tajweeds": ["Semua Kategori", "Sukun & Tanwin", "Mim Mukun", "Mim & Nun Tasydid", "Idghom", "Lam Ta'rif", "Tafkhim & Tarqiq", "Qolqolah", "Mad", "Ahkämul Al-hurüf"],
    "empty_list": "Tidak Ada Tajwid Yang Ditemukan!",
    "group": "Kelompok",
    "category": "Kategori",
    "detail_page_title": "Detil Tadjwid",
    "no_tajweed_found": "Tajweed tidak ditemukan!",
    "examples": "Contoh:",
    "sources": "Sumber:",
    "tajweed_laws": [
        {
            "id": 1,
            "name": "Idzhar",
            "group": "Ahkämul Al-hurüf",
            "category": "Sukun & Tanwin",
            "summary": "Hukum bacaan Idzhar/Idzhar Halqi terjadi apabila nun mati atau tanwin bertemu dengan huruf-huruf idzhar (ا ع غ ح خ ها), maka cara membacanya yaitu jelas, terang.",
            "detail": "Huruf-huruf idzhar ini dibaca jelas karena tempat keluarnya huruf-huruf tersebut adalah mulut, ada pada kerongkongan atau tenggorokan.",
            "examples": [
                "مِنْ آَلِ فِرْعَوْنَ  Nun mati bertemu dengan أ",
                "فَكُلُوا مِنْهَا حَيْثُ Nun mati bertemu dengan هـ",
                "بِغَافِلٍ عَمَّا تَعْمَلُونَ Nun mati bertemu dengan ع",
                "مِنْ غَفُورٍ رَحِيم Nun mati bertemu dengan غ",
                "أَنَّ اللَّهَ عَزِيزٌ حَكِيمٌ Tanwin bertemu dengan ح",
                "كُونُوا قِرَدَةً خَاسِئِينَ Tanwin bertemu dengan خ"
            ],
            "page": "/detail?tajweed=idzhar"
        },
        {
            "id": 2,
            "name": "Idgham Bigunnah",
            "group": "Ahkämul Al-hurüf",
            "category": "Sukun & Tanwin",
            "summary": "Hukum bacaan Idgham Bigunnah terjadi apabila nun mati atau tanwin bertemu dengan huruf-huruf idgham bigunnah (ي ن م و) maka dibacanya dengan mendengung.",
            "detail": "Idgham artinya memasukkan, dan bigunnah artinya mendengung. Jadi cara membacanya dengan ditasydidkan ke dalam salah satu huruf idham dengan suara yang mendengung.",
            "examples": [
                "مِنْ قَبْلِ أَنْ يَتَمَاسَّا Nun mati bertemu dengan ي",
                "إِلَّا سَاعَةً مِنْ نَهَارٍ Nun mati bertemu dengan ن",
                "وَأَنْفِقُوا مِنْ مَا رَزَقْنَاكُمْ Nun mati bertemu dengan م",
                "مِنْ دُونِهِ مِنْ وَالٍ Nun mati bertemu dengan و",
                "بِبُهْتَانٍ يَفْتَرِينَهُ Tanwin bertemu dengan ي",
                "حِطَّةٌ نَغْفِرْ لَكُمْ Tanwin bertemu dengan ن",
                "رَقَبَةٍ مِنْ قَبْلِ Tanwin bertemu dengan م",
                "مِنْ خَيْلٍ وَلَا رِكَابٍ Tanwin bertemu dengan و"
            ],
            "page": "/detail?tajweed=idgham_bigunnah"
        },
        {
            "id": 3,
            "name": "Idgham Bilagunnah",
            "group": "Ahkämul Al-hurüf",
            "category": "Sukun & Tanwin",
            "summary": "Hukum bacaan Idgham Bilagunnah terjadi apabila nun mati atau tanwin bertemu dengan huruf-huruf idgham bilagunnah (ل ر) maka dibacanya dengan dimasukkan namun tidak berdengung.",
            "detail": "Idgham artinya memasukkan, dan bilagunnah artinya tidak mendengung. Jadi cara membacanya dengan ditasydidkan ke dalam salah satu huruf idham dengan suara yang tidak mendengung.",
            "examples": [
                "فَضْلًا مِنْ رَبِّكَ Nun Mati bertemu dengan ر",
                "قَالَ لَمْ أَكُنْ لِأَسْجُدَ Nun Mati bertemu dengan ل",
                "لَا تَجْعَلْنَا فِتْنَةً لِلَّذِينَ Tanwin bertemu dengan ل",
                "سَيَقُولُونَ ثَلَاثَةٌ رَابِعُهُمْ Tanwin bertemu dengan ر"
            ],
            "page": "/detail?tajweed=idgham_bilagunnah"
        },
        {
            "id": 4,
            "name": "Iqlab",
            "group": "Ahkämul Al-hurüf",
            "category": "Sukun & Tanwin",
            "summary": "Hukum bacaan Iqlab terjadi apabila nun mati atau tanwin bertemu dengan huruf iqlab (ب) maka dibacanya dengan ditukar.",
            "detail": "Iqlab artinya meleburkan atau lebih mudahnya cara membacanya dengan menukar huruf menjadi huruf mim.",
            "examples": ["أَنْ تُنْبِتُوا Nun mati bertemu dengan ب", "كُلُّ حِزْبٍ بِمَا Tanwin bertemu dengan ب"],
            "page": "/detail?tajweed=iqlab"
        },
        {
            "id": 5,
            "name": "Ikhfa",
            "group": "Ahkämul Al-hurüf",
            "category": "Sukun & Tanwin",
            "summary": "Hukum bacaan Ikhfa/Ikhfa Haqiqi terjadi apabila nun mati atau tanwin bertemu dengan huruf-huruf ikhfa haqiqi (ت ث ج د ذ ز س ش ص ض ط ظ ف ق ك), maka dibacanya dengan samar-samar.",
            "detail": "Ikhfa artinya menyamar atau menyembunyikan sedangkan haqiqi artinya sungguh-sungguh. Jadi cara membacanya harus terang dengan adanya dengung.",
            "examples": [
                "أَنْتُمْ Nun mati bertemu dengan ت ",
                "مَنْثُورًا Nun mati bertemu dengan ث ",
                "فَأَنْجَيْنَاه Nun mati bertemu dengan ج",
                "عِنْدَهُ Nun mati bertemu dengan د",
                "لِيُنْذِرَكُمْ Nun mati bertemu dengan ذ",
                "أُنْزِلَ Nun mati bertemu dengan ز",
                "نَنْسَخْ Nun mati bertemu dengan س",
                "مَنْشُورً Nun mati bertemu dengan ش",
                "رِيحًا صَرْصَرًا Tanwin bertemu dengan ص",
                "وَكُلًّا ضَرَبْنَا Tanwin bertemu dengan ض",
                "صَعِيدًا طَيِّبًا Tanwin bertemu dengan ط",
                "ظِلًّا ظَلِيلً Tanwin bertemu dengan ظ",
                "سَفَرٍ فَعِدَّةٌ Tanwin bertemu dengan ف",
                "عَلِيمٌ قَدِيرٌ Tanwin bertemu dengan ق",
                "وَرِزْقٌ كَرِيمٌ Tanwin bertemu dengan ك"
            ],
            "page": "/detail?tajweed=ikhfa"
        },
        {
            "id": 6,
            "name": "Idzhar Syafawi",
            "group": "Ahkämul Al-hurüf",
            "category": "Mim Sukun",
            "summary": "Hukum bacaan Idzhar Syafawi terjadi apabila mim mati bertemu dengan huruf-huruf idzhar syafawi (ا ت ث ج ح خ د ذ ر ز س ش ص ض ط ظ ع غ ف ق ك ل ن و ه ي), maka tetap harus dibaca jelas meski mulut tertutup.",
            "detail": "Huruf idzhar syafawi ada banyak, kecuali mim dan ba, karena kedua huruf tersebut merupakan milik ikhfa syafawi dan idgham mimi.",
            "examples": [
                "أَأَنْذَرْتَهُمْ أَم Mim mati bertemu dengan ا",
                "أَنْعَمْتَ Mim mati bertemu dengan ت",
                "ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ Mim mati bertemu dengan ث",
                "أَنَّ لَهُمْ جَنَّاتٍ Mim mati bertemu dengan ج",
                "يَمْحَقُ اللَّهُ الرِّبَا Mim mati bertemu dengan ح"
            ],
            "page": "/detail?tajweed=idzhar_syafawi"
        },
        {
            "id": 7,
            "name": "Ikhfa Syafawi",
            "group": "Ahkämul Al-hurüf",
            "category": "Mim Sukun",
            "summary": "Hukum bacaan Ikhfa Syafawi terjadi apabila mim mati bertemu dengan huruf ikhfa syafawi (ب) maka dibaca dengan samar. Caranya menyamarkan suara mim mati dengan diiringi dengungan.",
            "detail": "Meskipun dengungnya tidak terlalu terdengar jelas karena huruf mim mati dan ba memiliki tempat keluar yang sama yaitu dua bibir. Huruf ikhfa syafawi hanya satu. Hurufnya sama seperti iqlab, namun cara membacanya tidak dileburkan seperti iqlab.",
            "examples": [
                "وَمَا هُمْ بِمُؤْمِنِينَ Mim mati bertemu dengan huruf ب",
                "وَهُمْ بِالْآَخِرَةِ Mim mati bertemu dengan huruf ب",
                "عَلَيْهِمْ بِعِلْمٍMim mati bertemu dengan huruf ب"
            ],
            "page": "/detail?tajweed=ikhfa_syafawi"
        },
        {
            "id": 8,
            "name": "Idgham Mimi",
            "group": "Ahkämul Al-hurüf",
            "category": "Mim Sukun",
            "summary": "Hukum bacaan Idgham Mimi terjadi apabila mim mati bertemu dengan huruf idgham mimi (م), maka dibacanya melebur menjadi satu.",
            "detail": "Huruf idgham mimi hanya satu, yaitu huruf mim. Jadi, idgham mimi adalah pertemuan dua huruf mim. Cara melafalkannya sama seperti melafadzkan mim yang bertasydid. Sebab, mim tasydid merupakan gabungan dari mim mati dan mim hidup.",
            "examples": [
                "وَكَمْ مِنْ قَرْيَةٍ Mim mati bertemu dengan م",
                "كُلَّمَا أَضَاءَ لَهُمْ مَشَوْا فِيهِ Mim mati bertemu dengan م",
                "إِلَيْكُمْ مِنْ رَبِّكُمْ Mim mati bertemu dengan م"
            ],
            "page": "/detail?tajweed=idgham_mimi"
        },
        {
            "id": 9,
            "name": "Gunnah",
            "group": "Ahkämul Al-hurüf",
            "category": "Nun Tasydid & Mim Tasydid",
            "summary": "Hukum bacaan Gunnah terjadi apabila ada mim yang bertasydid (مّ) dan nun yang bertasydid (نّ), maka dibaca dengan mendengung dan disebut dengan bacaan Ghunnah.",
            "detail": "Ghunnah artinya mendengung (di pangkal hidung). Jadi cara membacanya dengan mendengungkan huruf mim dan nun bertasydid di pangkal hidung selama 2 - 3 harokat.",
            "examples": [""],
            "page": "/detail?tajweed=gunnah"
        },
        {
            "id": 10,
            "name": "Idgham Mutamasilain",
            "group": "Ahkämul Al-hurüf",
            "category": "Idghom",
            "summary": "Hukum bacaan disebut Idgham Mutamasilain, yakni apabila suatu huruf bertemu huruf sesamanya, yang sama makhroj dan sifatnya, huruf yang pertama sukun (mati) dan huruf yang kedua berharakah.",
            "detail": "Cara membacanya adalah dengan memasukkan (mentasydid-kan) huruf sukun yang pertama pada huruf berharokat yang kedua. Dan ditekan sena ditahan tidak lebih dari satu harokat.",
            "examples": [""],
            "page": "/detail?tajweed=idgham_mutamasilain"
        },
        {
            "id": 11,
            "name": "Idgham Mutajaanisain",
            "group": "Ahkämul Al-hurüf",
            "category": "Idghom",
            "summary": "Hukum bacaan disebut Idgham Mutajaanisain, yakni apabila ada suatu huruf yang sukun berhadapan dengan huruf yang berharakat, kedua-duanya itu sama makhrojnya tapi lain sifatnya.",
            "detail": "Cara menbacanya adalah dengan memasukkan atau mengidghom-kan huruf pertama pada huruf yang kedua.",
            "examples": [""],
            "page": "/detail?tajweed=idgham_mutajaanisain"
        },
        {
            "id": 12,
            "name": "Idgham Mutaqooribain",
            "group": "Ahkämul Al-hurüf",
            "category": "Idghom",
            "summary": "Hukum bacaan disebut Idgham Mutaqooribain yakni, apabila ada huruf bersukun bertemu dengan huruf yang berharokat kedua huruf itu berdekatan makhroj dan sifatnya.",
            "detail": "Cara membacanya adalah dengan memasukkan atau mentasydid-kan huruf pertama pada huruf yang kedua.",
            "examples": [""],
            "page": "/detail?tajweed=idgham_mutaqooribain"
        },
        {
            "id": 13,
            "name": "Idzhar Qamariyah",
            "group": "Ahkämul Al-hurüf",
            "category": "Lam Ta'rif",
            "summary": "Hukum bacaan Idzhar Qamariyah terjadi apabila ada lam ta’rief bertemu dengan huruf-huruf idzhar qamariyah (ء ب ج ح خ ع غ ف ق ك م و ه ي), maka cara membacanya harus jelas.",
            "detail": "Qamar dalam bahasa arab memiliki arti bulan. Sedangkan lam ta’rief diumpamakan dengan bintang. Hal ini karena bintang tetap terlihat meskipun bertemu dengan bulan.",
            "examples": [
                "لَكُمُ الْأَرْضَ ذَلُولً Alif lam bertemu dengan ء",
                "فَارْجِعِ الْبَصَرَ Alif lam bertemu dengan ب",
                "أَصْحَابَ الْجَنَّةِ Alif lam bertemu dengan ج",
                "خَلَقَ الْمَوْتَ وَالْحَيَاةَ Alif lam bertemu dengan ح",
                "وَهُوَ اللَّطِيفُ الْخَبِيرُ Alif lam bertemu dengan خ"
            ],
            "page": "/detail?tajweed=idzhar_qamariyah"
        },
        {
            "id": 14,
            "name": "Idgham Syamsiyah",
            "group": "Ahkämul Al-hurüf",
            "category": "Lam Ta'rif",
            "summary": "Hukum bacaan Idgham Syamsiyah terjadi apabila ada lam ta’rief bertemu dengan huruf-huruf qamariyah lainnya, selain huruf idzhar qamariyah (ت ث د ذ ر ز س ش ص ض ط ظ ل ن), maka disebut dengan idhgam.",
            "detail": "Syamsiyah memiliki arti matahari, maka jika alif lam yang diumpakan bintang, bertemu dengan matahari, maka jadi tidak terlalu kelihatan. Karena tidak terbaca ini, maka alif lam yang bertemu dengan huruf syamsiyah, seperti ditasydidkan, atau dimasukkan ke huruf berikutnya.",
            "examples": [
                "وَأَنْزَلَ التَّوْرَاةَ Alif lam bertemu dengan ت",
                "مِنَ الثَّمَرَاتِ Alif lam bertemu dengan ث",
                "يَوْمِ الدِّينِ Alif lam bertemu dengan د",
                "وَالذَّاكِرِينَ Alif lam bertemu dengan ذ",
                "الرَّحْمَنِ Alif lam bertemu dengan ر"
            ],
            "page": "/detail?tajweed=idgham_syamsiyah"
        },
        {
            "id": 15,
            "name": "Tafkhim",
            "group": "Ahkämul Al-hurüf",
            "category": "Tafkhim & Tarqiq",
            "summary": "Hukum bacaan Tafkhim terjadi apabila ada huruf lam (ل) yang terdapat dalam perkataan Allah (اللّه) dan didahului oleh huruf yang berharokat Fathah atau Dlommah.",
            "detail": "Cara membacanya harus dibaca tebal atau Tafkhim yakni dengan cara mengangkat semua lidah dan menekannya ke langit-langit atas sambil menekankan suara yang cukup kuat.",
            "examples": [""],
            "page": "/detail?tajweed=tafkhim"
        },
        {
            "id": 16,
            "name": "Tarqiq",
            "group": "Ahkämul Al-hurüf",
            "category": "Tafkhim & Tarqiq",
            "summary": "Hukum bacaan Tarqiq terjadi apabila ada huruf lam (ل) yang terdapat dalam semua perkataan Allah (اللّه) dan didahului oleh huruf yang berharokat Kasroh.",
            "detail": "Cara membacanya harus dibaca tipis atau Tarqiq.",
            "examples": [""],
            "page": "/detail?tajweed=tarqiq"
        },
        {
            "id": 21,
            "name": "Qalqalah Sughra",
            "group": "Ahkämul Al-hurüf",
            "category": "Qolqolah",
            "summary": "Hukum bacaan qalqalah Sughra terjadi apabila ada huruf qalqalah (ب ج د ط ق) yang mati, maka cara membacanya harus membalik. Dibaca qalqalah sughra jika huruf qalqalah terletak di pertengahan kalimat.",
            "detail": "Qalqalah sughra dibaca lebih tipis, seperti arti sughra sendiri yang artinya kecil.",
            "examples": [
                "ثُمَّ لِيَقْطَعْ فَلْيَنْظُرْ Ada huruf Qaf mati di tengah kata",
                "ثَانِيَ عِطْفِهِ  Ada huruf Tho mati di tengah kata",
                "وَقَوْمُ إِبْرَاهِيمَ Ada huruf Ba mati di tengah kata",
                "فَعَلَيَّ إِجْرَامِي Ada huruf Ja mati di tengah kata",
                "يَدْعُو مِنْ دُونِ اللَّهِ  Ada huruf Da mati di tengah kata"
            ],
            "page": "/detail?tajweed=qalqalah_sughra"
        },
        {
            "id": 22,
            "name": "Qalqalah Kubra",
            "group": "Ahkämul Al-hurüf",
            "category": "Qolqolah",
            "summary": "Hukum bacaan Qalqalah Kubra terjadi apabila ada huruf qalqalah (ب ج د ط ق) yang mati, maka cara membacanya harus membalik. Dibaca qalqalah kubro jika huruf qalqalah berada di akhir kalimat.",
            "detail": "Qalqalah kubro cara membacanya dipantulkan lebih jelas dan lebih keras, seperti arti kubro yang artinya besar.",
            "examples": [
                "بَيْنِ الصُّلْبِ وَالتَّرَائِبِ Ada huruf Ba di akhir kalimat",
                "وَالسَّمَاءِ ذَاتِ الْبُرُوجِ Ada huruf Ja di akhir kalimat",
                "وَالْيَوْمِ الْمَوْعُودِ Ada huruf Da di akhir kalimat",
                "قَائِمًا بِالْقِسْطِ Ada huruf Tho di akhir kalimat",
                "وَالسَّمَاءِ وَالطَّارِقِ Ada huruf Qaf di akhir kalimat"
            ],
            "page": "/detail?tajweed=qalqalah_kubra"
        },
        {
            "id": 24,
            "name": "Mad Thabii",
            "group": "Ahkämul-madd",
            "category": "Mad",
            "summary": "Hukum bacaan disebut Mad Thobi'i yakni, apabila huruf yang dipanjangkan bunyi suaranya berupa huruf berharokat Dlommah (ُ) dan sesudahnya terdapat huruf Wau Sukun (ﻭْ), Huruf berharokat kasroh dan sesudahnya terdapat huruf Yaa' Sukun (ﻱْ), huruf berharokat fathah (َ) dan sesudahnya terdapat huruf Alif (ا)",
            "detail": "",
            "examples": [""],
            "page": "/detail?tajweed=mad_thabii"
        },
        {
            "id": 25,
            "name": "Mad Wajib Muttasil",
            "group": "Ahkämul-madd",
            "category": "Mad",
            "summary": "Hukum bacaan disebut Mad Wajib Muttasil yakni, apabila ada Mad Thobi'i bertemu dengan Hamzah (ء) berharokat hidup di dalam satu kata/kalimat.",
            "detail": "Cara membacanya wajib dipanjangkan sampai dua setengah Alif atau lima harokat atau dua setengah kali panjang Mad Thobi'i.",
            "examples": [""],
            "page": "/detail?tajweed=mad_wajib_muttasil"
        },
        {
            "id": 26,
            "name": "Mad Jaiz Munfassil",
            "group": "Ahkämul-madd",
            "category": "Mad",
            "summary": "Hukum bacaan disebut Mad Jaiz Munfashil yakni, apabila Mad Thobi'i bertemu dengan Hamzah (ء) di lain perkataan.",
            "detail": "Cara membacanya lebih baik dipanjangkan seperti panjangnya Mad Wajib Muttashil, tetapi juga boleh dipanjangkan seperti panjang Mad Thobi'i.",
            "examples": [""],
            "page": "/detail?tajweed=mad_jaiz_munfassil"
        },
        {
            "id": 27,
            "name": "Mad Lazim Mutsaqqal Kilmi",
            "group": "Ahkämul-madd",
            "category": "Mad",
            "summary": "Hukum bacaan disebut Mad Lazim Mutsaqqol Kilmi yakni, apabila Mad Thobi'i berhadapan dengan huruf yang ber-tasydid di dalam satu perkataan.",
            "detail": "Cara membacannya harus dipanjangkan lebih dahulu sepanjang 3 alif atau 6 harokat baru ditasydidkan.",
            "examples": [""],
            "page": "/detail?tajweed=mad_lazim_mutsaqqal_kilmi"
        },
        {
            "id": 28,
            "name": "Mad Lazim Mukhaffaf Kilmi",
            "group": "Ahkämul-madd",
            "category": "Mad",
            "summary": "Hukum bacaan disebut Mad Lazim Mukhaffaf Kilmi yakni, apabila Mad Thobi'i bertemu dengan huruf yang berharokat Sukun tidak di akhir perkataan. (dipanjangkan sampai tiga alif atau enam harokat).",
            "detail": "Cara membacanya sepert Mad Lazim Mutsaqqol Kilmi (dipanjangkan sampai tiga alif atau enam harokat).",
            "examples": [""],
            "page": "/detail?tajweed=mad_lazim_mukhaffaf_kilmi"
        },
        {
            "id": 29,
            "name": "Mad Layyin",
            "group": "Ahkämul-madd",
            "category": "Mad",
            "summary": "Hukum bacaan disebut Mad Layyin yakni, apabila ada huruf Mad, baik yang berupa Wau Sukun (ﻭْ) atau Yaa' Sukun (ﻱْ) didahului oleh huruf yang berharokat Fathah.",
            "detail": "Cara membacanya dengan lunak dan lemas.",
            "examples": [""],
            "page": "/detail?tajweed=mad_layyin"
        },
        {
            "id": 30,
            "name": "Mad Arid Lissukun",
            "group": "Ahkämul-madd",
            "category": "Mad",
            "summary": "Hukum bacaan disebut Mad Arid Lissukun yakni, apabila ada Mad Thobi'i atau Mad Layyin dan sesudahnya ada waqof (tempat berhenti).",
            "detail": "Cara membacanya ada 3 macam :\na. Yang lebih utama, yakni dibaca panjang, sama dengan Mad Wajib Mutashil (tiga alif atau enam harokat).\nb. Yang pertengahan (sedang), yakni dibaca dua alif atau empat harokat (dua kali Mad Thobi'i).\nc.Yang pendek, yakni boleh hanya dibaca seperti Mad Thobi'i biasa (dua harokat).",
            "examples": [""],
            "page": "/detail?tajweed=mad_arid_lissukun"
        },
        {
            "id": 31,
            "name": "Mad Shilah Qashirah",
            "group": "Ahkämul-madd",
            "category": "Mad",
            "summary": "Hukum bacaan disebut Mad Shilah Qashirah yakni, apabila ada huruf Haa Dlomir/kata ganti orang (benda) ketiga yang berupa (ه) berada sesudah huruf hidup (berharokat) dan sesudahnya tidak bertemu/dihubungkan dengan huruf bersukun atau huruf bertasydid dan atau huruf alif.",
            "detail": "Cara membacanya dipanjangkan sampai satu alif atau dua harokat atau seperti panjang Mad Thobi'i.",
            "examples": [""],
            "page": "/detail?tajweed=mad_shilah_qashirah"
        },
        {
            "id": 32,
            "name": "Mad Shilah Thawilah",
            "group": "Ahkämul-madd",
            "category": "Mad",
            "summary": "Hukum bacaan disebut Mad Shilah Thawilah yakni, apabila Mad Shilah Qoshiroh bertemu dengan Hamzah (ء) didahului oleh huruf yang berharokat hidup.",
            "detail": "Cara membacanya seperti bacaan Mad Jaiz Munfashil, artinya boleh dipanjangkan sampai dua setengah Alif atau satu Alif seperti Mad Thobi'i.",
            "examples": [""],
            "page": "/detail?tajweed=mad_shilah_thawilah"
        },
        {
            "id": 33,
            "name": "Mad Iwad",
            "group": "Ahkämul-madd",
            "category": "Mad",
            "summary": "Hukum bacaan disebut Mad Iwad yakni, apabila ada Fathatain (ً) yang jatuh pada waqof (pemberhentian), pada akhir kalimat (selain ta'marbuthoh) atau disebut Mad pengganti Tanwin sehingga Tanwin tidak berbunyi lagi.",
            "detail": "Cara membacanya dipanjangkan satu Alif seperti Mad Thobi'i.",
            "examples": [""],
            "page": "/detail?tajweed=mad_iwad"
        },
        {
            "id": 34,
            "name": "Mad Badal",
            "group": "Ahkämul-madd",
            "category": "Mad",
            "summary": "Apabila ada Hamzah (ء) bertemu dengan Mad yang berasal dari Hamzah Sukun,kemudian hamzah ini diubah dan diganti dengan Alif (ا), Wau (ﻭ)",
            "detail": "Cara membæanya harus dipanjangkan satu alif atau dua harokat seperti Mad Thobi'i.",
            "examples": [""],
            "page": "/detail?tajweed=mad_badal"
        },
        {
            "id": 35,
            "name": "Mad Tamkin",
            "group": "Ahkämul-madd",
            "category": "Mad",
            "summary": "Hukum bacaan disebut Mad Tamkin yakni, apabila ada Yaa' Sukun (ﻱْ) yang didahului dengan Yaa' yang bertasydid dan harokatnya kasroh (ﻱِ).",
            "detail": "Cara membacanya ditepatkan dengan tasydid dan Mad Thobi'i-nya sepanjang dua harokat atau satu alif.",
            "examples": [""],
            "page": "/detail?tajweed=mad_tamkin"
        },
        {
            "id": 36,
            "name": "Mad Farq",
            "group": "Ahkämul-madd",
            "category": "Mad",
            "summary": "Hukum bacaan disebut Mad Farq adalah satu Mad yang di dalam Al-Qur'an hanya terdapat di empat tempat.",
            "detail": "Cara membacanya harus dipanjangkan untuk membedakan antara pertanyaan atau bukan, jadi dipanjangkannya itu supaya jelas bahwa kalimat itu berbentuk pertanyaan.",
            "examples": [""],
            "page": "/detail?tajweed=mad_farq"
        }
    ]
}